### 1. 缺失值的处理

#### 1.1 删除：dropna

In [1]:
import pandas as pd 
import numpy as np

In [31]:
data = {'id':[1001,1002,1003,1004,1005,1006], 
        'date':pd.date_range('20130102', periods=6),
        'city':['Beijing ', np.nan, ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
        'age':[23,44,54,32,34,32],
        'category':['100-A','100-B','110-A','110-C','210-A','130-F'],
        'price':[1200,np.nan,2133,5433,np.nan,4432]}
df = pd.DataFrame(data,columns =['id','date','city','category','age','price'],index=['one','two','three','four','five','six'])
df

         id       date         city category  age   price
one    1001 2013-01-02     Beijing     100-A   23  1200.0
two    1002 2013-01-03          NaN    100-B   44     NaN
three  1003 2013-01-04   guangzhou     110-A   54  2133.0
four   1004 2013-01-05     Shenzhen    110-C   32  5433.0
five   1005 2013-01-06     shanghai    210-A   34     NaN
six    1006 2013-01-07     BEIJING     130-F   32  4432.0

In [8]:
df.iloc[0]=np.nan
df

           id       date         city category   age   price
one       NaN        NaT          NaN      NaN   NaN     NaN
two    1002.0 2013-01-03          NaN    100-B  44.0     NaN
three  1003.0 2013-01-04   guangzhou     110-A  54.0  2133.0
four   1004.0 2013-01-05     Shenzhen    110-C  32.0  5433.0
five   1005.0 2013-01-06     shanghai    210-A  34.0     NaN
six    1006.0 2013-01-07     BEIJING     130-F  32.0  4432.0

In [18]:
df.dropna(axis=1)

         id       date category  age
one    1001 2013-01-02    100-A   23
two    1002 2013-01-03    100-B   44
three  1003 2013-01-04    110-A   54
four   1004 2013-01-05    110-C   32
five   1005 2013-01-06    210-A   34
six    1006 2013-01-07    130-F   32

In [19]:
df.dropna(how='all',axis=1)#全行为缺失的时候，进行剔除

         id       date         city category  age   price
one    1001 2013-01-02     Beijing     100-A   23  1200.0
two    1002 2013-01-03          NaN    100-B   44     NaN
three  1003 2013-01-04   guangzhou     110-A   54  2133.0
four   1004 2013-01-05     Shenzhen    110-C   32  5433.0
five   1005 2013-01-06     shanghai    210-A   34     NaN
six    1006 2013-01-07     BEIJING     130-F   32  4432.0

#### 1.2 填充：fillna

In [20]:
df

         id       date         city category  age   price
one    1001 2013-01-02     Beijing     100-A   23  1200.0
two    1002 2013-01-03          NaN    100-B   44     NaN
three  1003 2013-01-04   guangzhou     110-A   54  2133.0
four   1004 2013-01-05     Shenzhen    110-C   32  5433.0
five   1005 2013-01-06     shanghai    210-A   34     NaN
six    1006 2013-01-07     BEIJING     130-F   32  4432.0

In [22]:
df.fillna({'price':14000,'city':'Beijing'})#通过字典

         id       date         city category  age    price
one    1001 2013-01-02     Beijing     100-A   23   1200.0
two    1002 2013-01-03      Beijing    100-B   44  14000.0
three  1003 2013-01-04   guangzhou     110-A   54   2133.0
four   1004 2013-01-05     Shenzhen    110-C   32   5433.0
five   1005 2013-01-06     shanghai    210-A   34  14000.0
six    1006 2013-01-07     BEIJING     130-F   32   4432.0

In [23]:
df.fillna(2000)

         id       date         city category  age   price
one    1001 2013-01-02     Beijing     100-A   23  1200.0
two    1002 2013-01-03         2000    100-B   44  2000.0
three  1003 2013-01-04   guangzhou     110-A   54  2133.0
four   1004 2013-01-05     Shenzhen    110-C   32  5433.0
five   1005 2013-01-06     shanghai    210-A   34  2000.0
six    1006 2013-01-07     BEIJING     130-F   32  4432.0

In [25]:
df.iloc[2:4,2]=np.nan
df.iloc[3:,5]=np.nan
df

         id       date      city category  age   price
one    1001 2013-01-02  Beijing     100-A   23  1200.0
two    1002 2013-01-03       NaN    100-B   44     NaN
three  1003 2013-01-04       NaN    110-A   54  2133.0
four   1004 2013-01-05       NaN    110-C   32     NaN
five   1005 2013-01-06  shanghai    210-A   34     NaN
six    1006 2013-01-07  BEIJING     130-F   32     NaN

In [30]:
# df['price']=df['price'].fillna(1300)
# df

         id       date      city category  age   price
one    1001 2013-01-02  Beijing     100-A   23  1200.0
two    1002 2013-01-03       NaN    100-B   44  1300.0
three  1003 2013-01-04       NaN    110-A   54  2133.0
four   1004 2013-01-05       NaN    110-C   32  1300.0
five   1005 2013-01-06  shanghai    210-A   34  1300.0
six    1006 2013-01-07  BEIJING     130-F   32  1300.0

In [27]:
df.fillna(method='ffill',limit=1)#前向填充

         id       date      city category  age   price
one    1001 2013-01-02  Beijing     100-A   23  1200.0
two    1002 2013-01-03  Beijing     100-B   44  1200.0
three  1003 2013-01-04       NaN    110-A   54  2133.0
four   1004 2013-01-05       NaN    110-C   32  2133.0
five   1005 2013-01-06  shanghai    210-A   34     NaN
six    1006 2013-01-07  BEIJING     130-F   32     NaN

In [28]:
df.fillna(method='bfill')#后向填充

         id       date      city category  age   price
one    1001 2013-01-02  Beijing     100-A   23  1200.0
two    1002 2013-01-03  shanghai    100-B   44  2133.0
three  1003 2013-01-04  shanghai    110-A   54  2133.0
four   1004 2013-01-05  shanghai    110-C   32     NaN
five   1005 2013-01-06  shanghai    210-A   34     NaN
six    1006 2013-01-07  BEIJING     130-F   32     NaN

#### 1.3 replace

In [35]:
data = {'id':[1001,1002,1003,1004,1005,1006], 
        'date':pd.date_range('20130102', periods=6),
        'city':['Beijing ', np.nan, ' SH ', 'Shenzhen', 'shanghai', 'BEIJING '],
        'age':[23,44,54,32,34,32],
        'category':['100-A','100-B','110-A','110-C','210-A','130-F'],
        'price':[1200,np.nan,2133,5433,np.nan,4432]}
df = pd.DataFrame(data,columns =['id','date','city','category','age','price'],index=['one','two','three','four','five','six'])
df

         id       date      city category  age   price
one    1001 2013-01-02  Beijing     100-A   23  1200.0
two    1002 2013-01-03       NaN    100-B   44     NaN
three  1003 2013-01-04       SH     110-A   54  2133.0
four   1004 2013-01-05  Shenzhen    110-C   32  5433.0
five   1005 2013-01-06  shanghai    210-A   34     NaN
six    1006 2013-01-07  BEIJING     130-F   32  4432.0

In [34]:
df['price'].replace(np.nan,1000000)

one         1200.0
two      1000000.0
three       2133.0
four        5433.0
five     1000000.0
six         4432.0
Name: price, dtype: float64

In [37]:
df['city'].str.strip().replace('SH','shanghai')

one       Beijing
two           NaN
three    shanghai
four     Shenzhen
five     shanghai
six       BEIJING
Name: city, dtype: object

### 2. 字符串的处理

pandas也包含了很多字符串的处理方法，我们主要介绍比较常用的：
+ lower和upper、title
+ contains
+ strip
+ split
+ join

In [2]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca cca', np.nan, 'CABA', 'dog', 'cat'])
s

0           A
1           B
2           C
3        Aaba
4    Baca cca
5         NaN
6        CABA
7         dog
8         cat
dtype: object

In [3]:
s.str.upper()#大写

0           A
1           B
2           C
3        AABA
4    BACA CCA
5         NaN
6        CABA
7         DOG
8         CAT
dtype: object

In [4]:
s.str.lower()#小写

0           a
1           b
2           c
3        aaba
4    baca cca
5         NaN
6        caba
7         dog
8         cat
dtype: object

In [5]:
s.str.title()#第一个字母大写

0           A
1           B
2           C
3        Aaba
4    Baca Cca
5         NaN
6        Caba
7         Dog
8         Cat
dtype: object

In [11]:
idx = pd.Series(['\r\n\tjack'+'\n', '\rjill ', ' jesse ', 'fra nk'])
idx.str.strip()#去除两边空格

0      jack
1      jill
2     jesse
3    fra nk
dtype: object

In [26]:
s2 = pd.Series(['acccc_b_c', 'c_d_a_e', np.nan, 'f_g_h','a'])
ss=s2.str.split('_')#拆分
print(ss)
ss.str.join('')#合并

0    [acccc, b, c]
1     [c, d, a, e]
2              NaN
3        [f, g, h]
4              [a]
dtype: object

0    accccbc
1       cdae
2        NaN
3        fgh
4          a
dtype: object

In [14]:
li=['a','b','c']
'=='.join(li)

'a==b==c'

In [18]:
s2.str.replace('_','')#替换

0    accccbc
1        cde
2        NaN
3        fgh
4          a
dtype: object

In [27]:
s2.str.contains('a',na=False)#判断是否包含某段字符串

0     True
1     True
2    False
3    False
4     True
dtype: bool

In [28]:
s2.str.startswith('a',na=False)#判断是否以‘什么’开头

0     True
1    False
2    False
3    False
4     True
dtype: bool

In [32]:
s2.str.slice(1,3)#提取部分信息

0     cc
1     _d
2    NaN
3     _g
4
dtype: object

### 3.  重命名索引

In [35]:
data = pd.DataFrame(np.arange(12).reshape(3,4),index=['Shenzhen','Shanghai','Beijing'],columns=['one','two','three','four'])
data

          one  two  three  four
Shenzhen    0    1      2     3
Shanghai    4    5      6     7
Beijing     8    9     10    11

In [38]:
data.index=data.index.str.upper()
data

          one  two  three  four
SHENZHEN    0    1      2     3
SHANGHAI    4    5      6     7
BEIJING     8    9     10    11

In [44]:
data.columns=list('abcd')
data

          a  b   c   d
SHENZHEN  0  1   2   3
SHANGHAI  4  5   6   7
BEIJING   8  9  10  11

**rename函数**

In [45]:
data

          a  b   c   d
SHENZHEN  0  1   2   3
SHANGHAI  4  5   6   7
BEIJING   8  9  10  11

In [47]:
data.rename(index={'BEIJING':'GUANGZHOU'},columns={'d':'e'})

           a  b   c   e
SHENZHEN   0  1   2   3
SHANGHAI   4  5   6   7
GUANGZHOU  8  9  10  11

In [49]:
data.rename(columns=str.upper,index={'BEIJING':'SH'})

          A  B   C   D
SHENZHEN  0  1   2   3
SHANGHAI  4  5   6   7
SH        8  9  10  11

### 4. 重复项处理

#### 4.1 判断重复项：duplicated

In [50]:
data=pd.DataFrame({'k1':['one']*3+['two']*4,
                   'k2':[1,1,2,3,3,4,4],'k3':[1,2,3,4,5,6,7]})
data

    k1  k2  k3
0  one   1   1
1  one   1   2
2  one   2   3
3  two   3   4
4  two   3   5
5  two   4   6
6  two   4   7

In [55]:
?pd.DataFrame.duplicated

In [58]:
data[['k1','k2']].duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

#### 4.2 删除重复项：drop_duplicates

In [63]:
df=data[['k1','k2']]
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [64]:
df.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

### 5. 离散化

#### 5.1 pandas.cut

In [80]:
arr = np.random.randn(10000)
# print(arr)
pd.cut(arr,bins=11).value_counts()#等距离散化

(-4.082, -3.3]         3
(-3.3, -2.526]        63
(-2.526, -1.753]     363
(-1.753, -0.979]    1215
(-0.979, -0.206]    2523
(-0.206, 0.567]     2990
(0.567, 1.341]      1998
(1.341, 2.114]       687
(2.114, 2.888]       142
(2.888, 3.661]        13
(3.661, 4.434]         3
dtype: int64

In [75]:
arr = np.random.randint(20,60,10)
arr

array([35, 56, 39, 41, 52, 56, 51, 43, 38, 39])

In [78]:
bins=[19,30,40,50,60]
pd.cut(arr,bins=bins).value_counts()#指定划分区域

(19, 30]    0
(30, 40]    4
(40, 50]    2
(50, 60]    4
dtype: int64

### 5.2 pandas.qcut

In [105]:
arr = np.random.randn(10000)

In [103]:
pd.qcut(arr,q=5).value_counts()#等频离散化

(-0.907, -0.489]      1
(-0.489, -0.00726]    1
(-0.00726, 0.391]     1
(0.391, 0.845]        1
(0.845, 1.788]        1
dtype: int64

In [106]:
pd.qcut(arr,q=[0,0.2,0.5,1]).value_counts()#按分位数，指定划分占比

(-3.702, -0.835]     2000
(-0.835, -0.0102]    3000
(-0.0102, 3.411]     5000
dtype: int64